Revit 2015 API
Material Properties
The Material type exposes the following members.
Properties
Name | Description
AppearanceAssetId
 The ElementId of the AppearanceAssetElement.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
Color
 The color of the material.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
CutPatternColor
 The color of the material cut pattern.
CutPatternId
 Gets and sets the cut fill pattern element.
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
Glow
 Whether the material can glow.
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
MaterialCagtegory |  Obsolete.
 The name of the material category, e.g. 'Wood'
MaterialCategory
 The name of the material category, e.g. 'Wood'
MaterialClass
 The name of the general material type, e.g. 'Wood.'
Name
A human readable name for the Element.
 (Inherited from Element.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[String]
Retrieves a parameter from the element given its name.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Shininess
 The shininess of the material.
Smoothness
 The smoothness of the material.
StructuralAssetId
 The ElementId of the structural PropertySetElement.
SurfacePatternColor
 The color of the material surface pattern.
SurfacePatternId
 Gets and sets the surface fill pattern element.
ThermalAssetId
 The ElementId of the thermal PropertySetElement.
Transparency
 The transparency of the material.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UseRenderAppearanceForShading
 True to use the render appearance settings for shaded view appearance, false to use the material's color and transparency value for shaded view appearance.
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
Material Class
Autodesk.Revit.DB Namespace